app/controllers/status_controller.rb

SELECT "feed_entries".* FROM "feed_entries"
---
  def index
  	#@update = FeedEntry.update_from_feed("http://blog.offerchat.com/feed")
  	@feeds = FeedEntry.all